input.xml

<?xml version='1.0' encoding='UTF-8'?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bsvc='urn:com.workday/bsvc'>
  <SOAP-ENV:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" SOAP-ENV:mustUnderstand="1">
      <wsse:UsernameToken>
        <wsse:Username>superuser@super</wsse:Username>
        <wsse:Password wsse:Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">vNz3RtPd4T@yhu7W</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <bsvc:Get_Purchase_Items_Request bsvc:version="v33.0"><bsvc:Response_Filter><bsvc:Count>200</bsvc:Count></bsvc:Response_Filter></bsvc:Get_Purchase_Items_Request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
